# Pandas Practice Notebook: 20+ Questions

This notebook contains exercises covering:
- `groupby` operations
- Indexing with `.iloc` and `.loc`
- Hardcoded / mode values for imputation
- Regex extraction with `str.extract`
- Merging and sorting
- Counts, aggregates, and descriptive statistics

No `lambda` is used in these examples.

In [1]:
import pandas as pd
import numpy as np

## Q1: Create Sample DataFrame

In [2]:
portal_traffic = pd.DataFrame({
    'visitor_id': ['100-James-4', '100-Faraz-22', '101-Julianna-17', '101-Judge1-9001', '101-Judge2-9002'],
    'hour_of_visit': [9.0, np.nan, 10.0, 9.0, 10.0],
    'activity': ['visit', 'submit', 'visit', 'grade', 'grade']
})

portal_traffic

        visitor_id  hour_of_visit activity
0      100-James-4            9.0    visit
1     100-Faraz-22            NaN   submit
2  101-Julianna-17           10.0    visit
3  101-Judge1-9001            9.0    grade
4  101-Judge2-9002           10.0    grade

## Q2: Impute Missing `hour_of_visit` Using Activity-Wise Mode (Hardcoded)

In [3]:
portal_traffic_imputed = portal_traffic.copy()

# Hard-coded modes
modes = {'visit': np.float32(10.0), 'grade': np.float32(9.0), 'submit': np.float32(9.0)}

for act, mode_val in modes.items():
    portal_traffic_imputed.loc[(portal_traffic_imputed['activity']==act) & (portal_traffic_imputed['hour_of_visit'].isna()), 'hour_of_visit'] = mode_val

portal_traffic_imputed['hour_of_visit'] = portal_traffic_imputed['hour_of_visit'].astype(np.float32)
portal_traffic_imputed

        visitor_id  hour_of_visit activity
0      100-James-4            9.0    visit
1     100-Faraz-22            9.0   submit
2  101-Julianna-17           10.0    visit
3  101-Judge1-9001            9.0    grade
4  101-Judge2-9002           10.0    grade

## Q3: Activity Counts per Hour using `groupby`

In [4]:
activity_counts_by_hour = portal_traffic_imputed.dropna(subset=['hour_of_visit']).groupby('hour_of_visit')['activity'].count()
activity_counts_by_hour

hour_of_visit
9.0     3
10.0    2
Name: activity, dtype: int64

## Q4: Extract Usernames from `visitor_id` using Regex

In [5]:
visitor_usernames = portal_traffic_imputed['visitor_id'].str.extract(r'-(\w+)-')[0]
visitor_usernames

0       James
1       Faraz
2    Julianna
3      Judge1
4      Judge2
Name: 0, dtype: object

## Q5: Extract Numeric IDs from `visitor_id`

In [6]:
visitor_ids = portal_traffic_imputed['visitor_id'].str.extract(r'-(\d+)$')[0]
visitor_ids

0       4
1      22
2      17
3    9001
4    9002
Name: 0, dtype: object

## Q6: Merge with another DataFrame

In [7]:
other_info = pd.DataFrame({
    'visitor_id': ['100-James-4','100-Faraz-22','101-Julianna-17','101-Judge1-9001','101-Judge2-9002'],
    'email_address': ['james@uni.edu','faraz@mit.edu','julianna@data.org','judge1@ai.com','judge2@ai.com'],
    'age': [22, 23, 21, 35, 36]
})

merged_info = portal_traffic_imputed.merge(other_info, on='visitor_id')
merged_info

        visitor_id  hour_of_visit activity      email_address  age
0      100-James-4            9.0    visit      james@uni.edu   22
1     100-Faraz-22            9.0   submit      faraz@mit.edu   23
2  101-Julianna-17           10.0    visit  julianna@data.org   21
3  101-Judge1-9001            9.0    grade      judge1@ai.com   35
4  101-Judge2-9002           10.0    grade      judge2@ai.com   36

## Q7: Extract Email Domain using Regex

In [8]:
merged_info['email_domain'] = merged_info['email_address'].str.extract(r'@(.+)$')[0]
merged_info

,visitor_id,hour_of_visit,activity,email_address,age,email_domain
0,100-James-4,9.0,visit,james@uni.edu,22,uni.edu
1,100-Faraz-22,9.0,submit,faraz@mit.edu,23,mit.edu
2,101-Julianna-17,10.0,visit,julianna@data.org,21,data.org
3,101-Judge1-9001,9.0,grade,judge1@ai.com,35,ai.com
4,101-Judge2-9002,10.0,grade,judge2@ai.com,36,ai.com

## Q8: First Letter of First Name from visitor_id

In [9]:
merged_info['first_letter'] = merged_info['visitor_id'].str.extract(r'-(\w)')[0]
merged_info

,visitor_id,hour_of_visit,activity,email_address,age,email_domain,first_letter
0,100-James-4,9.0,visit,james@uni.edu,22,uni.edu,J
1,100-Faraz-22,9.0,submit,faraz@mit.edu,23,mit.edu,F
2,101-Julianna-17,10.0,visit,julianna@data.org,21,data.org,J
3,101-Judge1-9001,9.0,grade,judge1@ai.com,35,ai.com,J
4,101-Judge2-9002,10.0,grade,judge2@ai.com,36,ai.com,J

## Q9: Sort by `hour_of_visit` descending

In [10]:
merged_info_sorted = merged_info.sort_values('hour_of_visit', ascending=False).reset_index(drop=True)
merged_info_sorted

,visitor_id,hour_of_visit,activity,email_address,age,email_domain,first_letter
0,101-Julianna-17,10.0,visit,julianna@data.org,21,data.org,J
1,101-Judge2-9002,10.0,grade,judge2@ai.com,36,ai.com,J
2,100-James-4,9.0,visit,james@uni.edu,22,uni.edu,J
3,100-Faraz-22,9.0,submit,faraz@mit.edu,23,mit.edu,F
4,101-Judge1-9001,9.0,grade,judge1@ai.com,35,ai.com,J

## Q10: Select Row using `iloc`

In [11]:
third_row = merged_info_sorted.iloc[2]
third_row

visitor_id         100-James-4
hour_of_visit              9.0
activity                 visit
email_address    james@uni.edu
age                         22
email_domain           uni.edu
first_letter                 J
Name: 2, dtype: object

## Q11: Count Activities per Email Domain using `groupby`

In [12]:
activity_per_domain = merged_info.groupby('email_domain')['activity'].count()
activity_per_domain

email_domain
ai.com      2
data.org    1
mit.edu     1
uni.edu     1
Name: activity, dtype: int64

## Q12: Extract Log Levels from Log Lines (Regex)

In [13]:
logs = pd.Series([
    '[2024-10-01 09:15] INFO login',
    '[2024-10-01 09:17] WARN timeout',
    '[2024-10-01 09:20] ERROR fail'
])

log_levels = logs.str.extract(r'\] (\w+)')[0]
log_levels

0     INFO
1     WARN
2    ERROR
Name: 0, dtype: object

## Q13: Extract Timestamps from Logs

In [14]:
timestamps = logs.str.extract(r'\[(.*?)\]')[0]
timestamps

0    2024-10-01 09:15
1    2024-10-01 09:17
2    2024-10-01 09:20
Name: 0, dtype: object

## Q14: Extract First Word from Strings

In [15]:
sentences = pd.Series(['Hello world', 'Regex is fun', 'Python rules'])
first_words = sentences.str.extract(r'^(\w+)')[0]
first_words

0     Hello
1     Regex
2    Python
Name: 0, dtype: object

## Q15: Count Unique Activities

In [16]:
activity_counts = portal_traffic_imputed['activity'].value_counts()
activity_counts

activity
visit     2
grade     2
submit    1
Name: count, dtype: int64

## Q16: Hardcoded Fill for Missing Age in `merged_info`

In [17]:
merged_info['age'] = merged_info['age'].fillna(25)
merged_info

,visitor_id,hour_of_visit,activity,email_address,age,email_domain,first_letter
0,100-James-4,9.0,visit,james@uni.edu,22,uni.edu,J
1,100-Faraz-22,9.0,submit,faraz@mit.edu,23,mit.edu,F
2,101-Julianna-17,10.0,visit,julianna@data.org,21,data.org,J
3,101-Judge1-9001,9.0,grade,judge1@ai.com,35,ai.com,J
4,101-Judge2-9002,10.0,grade,judge2@ai.com,36,ai.com,J

## Q17: Extract Numeric from Mixed Strings

In [18]:
mixed = pd.Series(['abc123', 'xyz456', 'foo789'])
numbers = mixed.str.extract(r'(\d+)')[0]
numbers

0    123
1    456
2    789
Name: 0, dtype: object

## Q18: Extract Last Letter of `visitor_id`

In [19]:
merged_info['last_letter'] = merged_info['visitor_id'].str[-1]
merged_info

,visitor_id,hour_of_visit,activity,email_address,age,email_domain,first_letter,last_letter
0,100-James-4,9.0,visit,james@uni.edu,22,uni.edu,J,4
1,100-Faraz-22,9.0,submit,faraz@mit.edu,23,mit.edu,F,2
2,101-Julianna-17,10.0,visit,julianna@data.org,21,data.org,J,7
3,101-Judge1-9001,9.0,grade,judge1@ai.com,35,ai.com,J,1
4,101-Judge2-9002,10.0,grade,judge2@ai.com,36,ai.com,J,2

## Q19: Filter by Activity

In [20]:
grade_rows = portal_traffic_imputed.loc[portal_traffic_imputed['activity']=='grade']
grade_rows

        visitor_id  hour_of_visit activity
3  101-Judge1-9001            9.0    grade
4  101-Judge2-9002           10.0    grade

## Q20: Hardcoded Assignment for a Column

In [21]:
portal_traffic_imputed['hardcoded_col'] = 1
portal_traffic_imputed

        visitor_id  hour_of_visit activity  hardcoded_col
0      100-James-4            9.0    visit              1
1     100-Faraz-22            9.0   submit              1
2  101-Julianna-17           10.0    visit              1
3  101-Judge1-9001            9.0    grade              1
4  101-Judge2-9002           10.0    grade              1